"""Создать базу данных с названием order_service_db. Создать в ней несколько таблиц:

- id заявки (order_id) - целое число
- дата создания (created_dt) - текст
- дата обновления заявки (updated_dt) - текст
- тип заявки (order_type) - текст
- описание (description) - текст
- статус заявки (status) - текст
- серийный номер аппарата (serial_no) - целое число
- id создателя заявки (creator_id) - целое число

Таблица СОТРУДНИКИ (employees)
- id сотрудника (employee_id) - целое число
- ФИО (fio) - текст
- должность (position) - текст
- id подразделения (department_id) - целое число

Таблица ПОДРАЗДЕЛЕНИЯ (departments)
- id подразделения (department_id) - целое число
- название подразделения (department_name) - текст

Написать код создания таблиц на языке SQL, предусмотреть необходимые ограничения."""


# Таблица заявки
